{"id":151,"date":"2025-04-07T23:18:32","date_gmt":"2025-04-07T23:18:32","guid":{"rendered":"https:\/\/hyperhq.com\/?page_id=151"},"modified":"2025-04-08T01:35:01","modified_gmt":"2025-04-08T01:35:01","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/hyperhq.com\/terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<h1 style=\"text-align: center;\">Terms of use<\/h1>\n<p>These Terms of Use govern your access to and use of our website and application. Please read these Terms of Use carefully, and contact us if you have any questions. Your use of our Website and App indicates that you have read and accepted these Terms of Use and you warrant that you have the legal capacity to accept these Terms of Use. We are committed to protecting your privacy. Our privacy policy is available at www.hyperhq.com . By agreeing to these Terms of Use, you also agree to the terms in our privacy policy.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>1. Licence<\/h2>\n<p>1.1 We grant you a non-exclusive, royalty-free, revocable, worldwide, non-transferable right and licence to use our Website and App for your personal use in accordance with these Terms of Use.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>2. Our intellectual property rights<\/h2>\n<p>2.1 Our Website and App contain material which is owned by or licensed to us and is protected by Australian and international laws, including without limitation the trademarks, trade names, software, content, design, images, graphics, layout, appearance and look of our Website and App.<\/p>\n<p>&nbsp;<\/p>\n<p>2.2 We own the copyright which subsists in all creative and literary works displayed on our Website and App.<\/p>\n<p>&nbsp;<\/p>\n<p>2.3 As between you and us, we own all the intellectual property rights in our Website and App and nothing in these Terms of Use constitutes a transfer of the ownership of any intellectual property rights to you.<\/p>\n<p>&nbsp;<\/p>\n<p>2.4 Your use of our Website and App does not grant you a licence, or act as a right of use, of any of the intellectual property, whether registered or unregistered, displayed on our Website or App without the express written permission of the owner.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>3. Content<\/h2>\n<p>3.1 We allow you to post content on our Website and App (User Content). You are solely responsible for the User Content that you post on our Website and App.<\/p>\n<p>&nbsp;<\/p>\n<p>3.2 When you add User Content to our Website and App, you:<\/p>\n<p>&nbsp;<\/p>\n<p>(a) warrant that you have all necessary rights to post the User Content;<\/p>\n<p>&nbsp;<\/p>\n<p>(b) grant us a perpetual, non-exclusive, royalty-free, irrevocable, worldwide and transferable right and licence to use the User Content in any way (including without limitation reproducing, changing and communicating the content to the public) and permit us to authorise any other person to do the same; and<\/p>\n<p>&nbsp;<\/p>\n<p>(c) consent to any act or omission by us or authorised by us which would otherwise constitute an infringement of your moral rights, and if you add any User Content in which any third party has moral rights, you must ensure that the third party consents in the same manner.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>4. Prohibited conduct<\/h2>\n<p>4.1 You must not:<br \/>\n(a) use our Website or App for any activities, or post or transmit any material from our Website or App:<br \/>\n(i) unless you hold all necessary rights, licences and consents to do so;<br \/>\n(ii) that infringes the intellectual property or other rights of any person;<br \/>\n(iii) that would cause you or us to breach any law, regulation, rule, code or other legal obligation;<br \/>\n(iv) that defames, harasses, threatens, menaces or offends any person;<br \/>\n(v) that is or could reasonably be considered to be obscene, inappropriate, defamatory, disparaging, indecent, seditious, offensive, pornographic, threatening, abusive, liable to incite racial hatred, discriminatory,\u2028blasphemous, in breach of confidence or in breach of privacy; or<br \/>\n(vi) that would bring us, or our Website or App, into disrepute;<br \/>\n(b) use our Website or App to transmit, distribute, post or submit any information concerning any other person or entity without their permission (including without limitation photographs, personal contact information or credit card details);<br \/>\n(c) use our Website or App to send unsolicited messages to other users;<br \/>\n(d) perform any acts which would damage, interfere with or inhibit the use of our Website and App;<br \/>\n(e) use or attempt to use any engines, software, tools, or other mechanisms (including without limitation browsers, spiders, robots, avatars or intelligent agents) to navigate or search our Website other than the commonly recognised search engine and agents and other generally available third party web browsers;<br \/>\n(f) attempt to decipher, decompile, disassemble or reverse engineer any of the code or software comprising in or in any way making up a part of our Website or App;<br \/>\n(g) engage in any screen scraping or data acquisition and consolidation;<br \/>\n(h) alter or modify, or attempt to alter or modify, any of the code or material on our Website or App;<br \/>\n(i) cause any of the material on our Website or App to be framed or embedded in another website;<br \/>\n(j) create derivative works from the contents of our Website or App; or<br \/>\n(k) advocate, encourage or assist any third party in doing any of the foregoing.<\/p>\n<p>4.2 We reserve the right to amend or delete any and all User Content and to block you from our Website and App if we believe that there is a violation of these Terms of Use.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>5. Information<\/h2>\n<p>5.1 Any information made available on our Website or App, including any recommendations, statements and opinions contained on our Website or App whether published by us or any other user (Information), is for general information purposes only. The Information does not take into account your specific circumstances and any reliance you place on the Information is at your own risk.<\/p>\n<p>&nbsp;<\/p>\n<p>5.2 Before acting on any Information, we recommend that you:<br \/>\n(a) consider whether it is appropriate for your personal circumstances;<br \/>\n(b) carry out your own research; and<br \/>\n(c) seek professional advice where necessary.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>6. Third party links<\/h2>\n<p>6.1 Our Website and App may contain links to third-party websites, advertisers, services, special offers or other events or activities that are not owned or controlled by us. We do not endorse, sponsor or approve any such third-party sites, information, materials, products or services.<\/p>\n<p>&nbsp;<\/p>\n<p>6.2 If you access any third party website, service or content via our Website or App, you do so at your own risk. We will have no liability arising from your use of or access to any third-party website, service or content.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms of use These Terms of Use govern your access to and use of our website and application. Please read these Terms of Use carefully, and contact us if you have any questions. Your use of our Website and App indicates that you have read and accepted these Terms of Use and you warrant that you have the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-terms.php","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-151","page","type-page","status-publish","hentry"],"acf":[],"_links":{"self":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/pages\/151","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/comments?post=151"}],"version-history":[{"count":0,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/pages\/151\/revisions"}],"wp:attachment":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/media?parent=151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}