{"id":416,"date":"2024-12-03T15:39:23","date_gmt":"2024-12-03T15:39:23","guid":{"rendered":"https:\/\/hyperhq.com\/?post_type=insight&#038;p=416"},"modified":"2025-06-20T13:53:44","modified_gmt":"2025-06-20T03:53:44","slug":"how-design-thinking-can-help-shape-your-idea","status":"publish","type":"insight","link":"https:\/\/hyperhq.com\/insights\/how-design-thinking-can-help-shape-your-idea\/","title":{"rendered":"How Design Thinking Can Help Shape Your Idea"},"content":{"rendered":"<p id=\"d0b0\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Building your app idea on the wrong assumptions can cost your product its success. A design thinking approach can help you gain valuable insights into the problem you’re trying to solve and the people who are struggling with it.<\/p>\n<p id=\"cdf8\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Design, design, design! When you’re in the business of building apps and have neither a technical nor a design background, you might be surprised how often you’ll hear this word thrown around. You may be making the mistake of thinking that design is all about how your product looks, how the sections are set on the screen, how big a button is, or what colours the app is using.<\/p>\n<h2 id=\"353a\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\" data-selectable-paragraph=\"\">In truth, <strong class=\"am\">design has stopped being only about looks<\/strong> a while ago.<\/h2>\n<blockquote class=\"yb yc yd\">\n<p id=\"d689\" class=\"wk wl ye wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\"><em class=\"rh\">“Most people make the mistake of thinking design is what it looks like. People think it’s this veneer — that the designers are handed this box and told, ‘Make it look good!’ That’s not what we think design is. It’s not just what it looks like and feels like. Design is how it works.” <\/em>— <a class=\"ag oc\" href=\"https:\/\/www.nytimes.com\/2003\/11\/30\/magazine\/the-guts-of-a-new-machine.html\" target=\"_blank\" rel=\"noopener ugc nofollow\">Steve Jobs<\/a><\/p>\n<\/blockquote>\n<p id=\"246c\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Design has become more about market relevance and meaningful results. John Maeda, Sillicon Valley executive, designer and technologist, has been<a class=\"ag oc\" href=\"https:\/\/www.wired.com\/2015\/03\/take-expert-design-important-ever\/\" target=\"_blank\" rel=\"noopener ugc nofollow\"> making the case for the business value of design<\/a> since 2015. Through his work, he has been connecting the worlds of design, technology and business together, so that people wouldn’t see them as three different things. <a class=\"ag oc\" href=\"https:\/\/designintech.report\/\" target=\"_blank\" rel=\"noopener ugc nofollow\">He argues<\/a> that 63 design firms were acquired by big tech names like Google, Facebook, Accenture or IBM.<\/p>\n<p id=\"fcdb\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Moreso, companies with strong design philosophies, including Apple, Coca-Cola, IBM, Nike, Procter &amp; Gamble and Whirlpool have outperformed the S&amp;P 500 over the past 10 years by an extraordinary 219%, as reported by the <a class=\"ag oc\" href=\"http:\/\/www.dmi.org\/?page=designdrivesvalue\" target=\"_blank\" rel=\"noopener ugc nofollow\">Design Management Institute<\/a> in a 2014 assessment.<\/p>\n<p id=\"33e6\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">So we can confidently say that applying design methodologies to your app development process will give you a boost in becoming a success. <strong class=\"wm ku\">But what are you supposed to do, with no design background?<\/strong><\/p>\n<h2 id=\"9b81\" class=\"yf xj rh bf xk kv yg kw ky kz yh la lc ie yi if ii lf yj lg lj lk yk ll lo yl bk\">You don’t have to be a designer to think like one<\/h2>\n<p id=\"55a6\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">Before any designer puts one line on the paper (or the screen), they spend significant time thinking about how to approach the project they have in front of them. Rather than talk about what’s committed to paper for a product’s design, let’s talk about the design thinking going on.<\/p>\n<blockquote class=\"yr\">\n<p id=\"d277\" class=\"ys yt rh bf yu yv yw yx yy yz za xh dt\" data-selectable-paragraph=\"\"><strong class=\"am\"><em class=\"zb\">What is design thinking?<\/em><\/strong> Well, in simple words, it’s the way you approach a problem to solve it.<\/p>\n<\/blockquote>\n<p id=\"5249\" class=\"pw-post-body-paragraph wk wl rh wm b wn zc wp wq wr zd wt wu wv ze wx wy wz zf xb xc xd zg xf xg xh ew bk\" data-selectable-paragraph=\"\">It’s especially useful when the problem in front of you is complex or unknown, as it makes you understand the human needs involved. It helps you re-frame the issue from a human-centric point of view, brainstorm possible solutions, prototype one in a hands-on approach and test it in the real world.<\/p>\n<p id=\"0e79\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\"><a class=\"ag oc\" href=\"https:\/\/www.interaction-design.org\/literature\/article\/5-stages-in-the-design-thinking-process\" target=\"_blank\" rel=\"noopener ugc nofollow\">Design thinking<\/a> was first defined in 1969, by Nobel Prize laureate Herbert Simon in his work on design methods called <em class=\"ye\">“The Sciences of the Artificial”<\/em>. While his model consists of seven major stages, the more current interpretation — the five-stage model proposed by the Hasso-Plattner Institute of Design at Stanford, the leading university in teaching Design Thinking — is a lot more well known and more widely applied.<\/p>\n<p id=\"328c\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Next, we’ll walk you through the five stages, so you too can learn how to apply design thinking in developing your own product.<\/p>\n<h3 id=\"3961\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\">Step 1. Empathise<\/h3>\n<p id=\"0925\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">The first stage of approaching a problem with a design thinking mindset is to immerse yourself in the problem. Talk to experts to understand their view on your area of concern. Engage and shadow the people who are most affected by the problem and see how they’re handling it now. This is a good moment to conduct more or less formal interviews to get a clear understanding of who your potential users are, what characterises them, what their frustrations and goals are.<\/p>\n<p id=\"d266\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Depending on how much time and resources you have, this stage can turn into a research marathon or just a dipping on toes into the data pool. Either way, <strong class=\"wm ku\">make sure you expose yourself to different approaches and perspectives<\/strong>, to gain a fuller experience.<\/p>\n<h3 id=\"83a0\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\">Step 2. Define<\/h3>\n<p id=\"11bf\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">At this point, your job is to analyse and synthetise the information you’ve gathered in the previous stage. Define core problems that you have seen repeating and how it manifests in different types of audiences. Some may be more affected by the problem you’re tackling than others. Especially when you’re working to define your MVP, <strong class=\"wm ku\">prioritising problems<\/strong> that have greater reverberations in a larger audience will give your product more chances of success once you launch it.<\/p>\n<p id=\"7edb\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">Don’t be surprised when the problems you identify is moving you towards asking questions that lead you to solutions. That is, after all, the whole purpose of this exercise. Do make sure that you’ve gotten all the insights out of your research that you can, before moving forward to the next stage.<\/p>\n<h3 id=\"00a8\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\">Step 3. Ideate<\/h3>\n<p id=\"ec9c\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">With all perspectives of the problem in front of you and the valuable insights you’ve gained, you’re ready to think about solutions. It’s important to get as many ideas as possible on the table at the beginning of this session. Don’t worry about budget, or implementation time, or human resources. <strong class=\"wm ku\">The more approaches you can think of, and the more possible features you can put on the list for your product, the easier it will be to narrow them down.<\/strong><\/p>\n<p id=\"99b7\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">At the end of this stage, you may want to take a few ideas and run them by people who have helped you in the first stage. At this point, getting verbal feedback is valuable in helping you narrow down to the best solution available. From the feedback you get, decide on a handful of ideas that you want to take to the next stage.<\/p>\n<h3 id=\"d9d5\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\">Step 4. Prototype<\/h3>\n<p id=\"4645\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">When you hear prototype, you may think of complex, real-looking app prototypes. But the truth of the matter is that an inexpensive — let me ask my friend with better drawing skills than I have to put some boxes on a bunch of papers — prototype is more than enough for this experimental phase. Your purpose is to show your idea around your colleagues, a group of friends, the dedicated mentor and getting validation for your solutions. If one of your acquaintances happens to be the living embodiment of the audience you’re targeting, make sure you reach out to them as well.<\/p>\n<p id=\"4b20\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">You’ll notice at this point that the feedback you receive will be very useful in better understanding how users would behave, think and feel when interacting with the end product. <strong class=\"wm ku\">At the end of this stage, you’ll feel more confident to invest more resources in the solution that gets the most positive feedback.<\/strong><\/p>\n<h3 id=\"01eb\" class=\"xi xj rh bf xk xl xm xn ky xo xp xq lc wv xr xs xt wz xu xv xw xd xx xy xz ya bk\">Step 5. Test<\/h3>\n<p id=\"28e8\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">At this stage, you’re ready to put forward a product, whether it’s a high-definition prototype or a beta version of your app. Your purpose here is to make a realistic rendering of your product and go wider with its promotion than your current social circles: join a startup-themed meetup, present at a pitch night, get in front of retail investors. <strong class=\"wm ku\">Get real feedback from real people<\/strong>, that have no reason to sugarcoat their thinking.<\/p>\n<p id=\"815e\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">While testing is the last stage in the design thinking framework, the process should be considered an iterative endeavour: the results you get from testing may be used to redefine the scope of your product and to get more information on how users feel and behave when they’re using your product. From there, you can move onto a new cycle of design thinking, with the stated purpose of building a better version of your product.<\/p>\n<h2 id=\"b9ce\" class=\"yf xj rh bf xk kv yg kw ky kz yh la lc ie yi if ii lf yj lg lj lk yk ll lo yl bk\">Design thinking makes your product the best version of itself<\/h2>\n<p id=\"c7d1\" class=\"pw-post-body-paragraph wk wl rh wm b wn ym wp wq wr yn wt wu wv yo wx wy wz yp xb xc xd yq xf xg xh ew bk\" data-selectable-paragraph=\"\">At the end of the day, the design thinking process is iterative, flexible and with the focus set on the collaboration between product owners (or designers) and users. Its framework helps you come up with ideas that are based on how users think, feel and behave. Most importantly, if you keep the wheel of design thinking turning, your product will get better with every iteration and get closer to success by directly responding to the needs of your users.<\/p>\n<p id=\"ca6b\" class=\"pw-post-body-paragraph wk wl rh wm b wn wo wp wq wr ws wt wu wv ww wx wy wz xa xb xc xd xe xf xg xh ew bk\" data-selectable-paragraph=\"\">In an industry where making the wrong assumptions can cost you the success of your product, a design thinking approach can keep you grounded in realistic information about your users. Truthfully, there’s little else that’s more crucial to the success of your business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Building your app idea on the wrong assumptions can cost your product its success. A design thinking approach can help you gain valuable insights into the problem you’re trying to solve and the people who are struggling with it. Design, design, design! When you’re in the business of building apps and have neither a technical [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":417,"parent":0,"menu_order":0,"template":"","meta":{"_acf_changed":false},"categories":[],"tags":[],"class_list":["post-416","insight","type-insight","status-publish","has-post-thumbnail","hentry"],"acf":[],"_links":{"self":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/insight\/416","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/insight"}],"about":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/types\/insight"}],"author":[{"embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/users\/7"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/media\/417"}],"wp:attachment":[{"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/media?parent=416"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/categories?post=416"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/hyperhq.com\/wp-json\/wp\/v2\/tags?post=416"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}